# Analytical functions

In [50]:
%load_ext sql
%sql oracle+cx_oracle://hr:oracle@srv2.lan:1521/free

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

In [2]:
%%sql
SELECT
   C.region_id, 
   MAX(R.region_name) AS region
   ,LISTAGG(C.country_name, ', ') 
   WITHIN GROUP (ORDER BY C.country_name) AS LIST
FROM countries C 
LEFT JOIN regions R ON C.region_id = R.region_id  
GROUP BY C.region_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+
| region_id |  region  |                                                           list                                                           |
+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+
|     10    |  Europe  | Belgium, Denmark, France, Germany, Italy, Netherlands, Switzerland, United Kingdom of Great Britain and Northern Ireland |
|     20    | Americas |                               Argentina, Brazil, Canada, Mexico, United States of America                                |
|     30    |   Asia   |                                 China, India, Israel, Japan, Kuwait, Malaysia, Singapore                                 |
|     40    | Oceania  |                                                        Australia                                                         |
|     50    |  Africa  |                                             Egypt, Nigeria, Zambia, Zimbabwe                                             |
+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+

## Over + listagg
Req: Oracle 21c
Apply the function over all rows with the same partition key as this row

In [ ]:
%%sql
SELECT 
  country_name,
  region_id,
  LISTAGG(country_name, ', ') 
    WITHIN GROUP (ORDER BY country_name) 
    OVER (PARTITION BY region_id) 
    AS countries_in_region 
FROM countries
WHERE REGION_ID = 50

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------------+-----------+----------------------------------+
| country_name | region_id |       countries_in_region        |
+--------------+-----------+----------------------------------+
|    Egypt     |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|   Nigeria    |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|    Zambia    |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|   Zimbabwe   |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
+--------------+-----------+----------------------------------+

In [7]:
%load_ext sql
%sql oracle+cx_oracle://co:oracle@srv2.lan:1521/free

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

In [17]:
%%sql
SELECT 
shipment_id,
CUSTOMER_ID,
DELIVERY_ADDRESS,
COUNT(1) OVER() total_system,
COUNT (1) OVER (PARTITION BY CUSTOMER_ID) customer_shipments,
ROUND(
  100.0 * COUNT(CASE WHEN SHIPMENT_STATUS = 'DELIVERED' THEN 1 END)
  OVER (PARTITION BY CUSTOMER_ID)
  / COUNT(*) OVER (PARTITION BY CUSTOMER_ID),
  2
) AS customer_delivery_ratio
,
-- 21c
COUNT(DISTINCT DELIVERY_ADDRESS) 
OVER (PARTITION BY CUSTOMER_ID) AS cust_distinct_addr
FROM SHIPMENTS

Running query in 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
| shipment_id | customer_id |    delivery_address    | total_system | customer_shipments | customer_delivery_ratio | cust_distinct_addr |
+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
|     1669    |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     1670    |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     241     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     301     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     274     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     300     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     273     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|      5      |      2      | Spencer, MA 01562 USA  |     1892     |         2          |           100           |         1          |
|      4      |      2      | Spencer, MA 01562 USA  |     1892     |         2          |           100           |         1          |
|     1046    |      3      | Webster, MA 01570 USA  |     1892     |         11         |           100           |         1          |
+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
Truncated to displaylimit of 10.

## First value
- be careful with last_value function

In [18]:
%%sql
SELECT 
order_id,
customer_id,
count(*) over (partition by customer_id) as count,
first_value(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id ) over (partition by customer_id order by order_tms desc) as newest,
first_value(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id )  over (partition by customer_id order by order_tms asc) as oldest,
listagg(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id , ' | ' ) over (partition by customer_id) as checks
FROM orders

Running query in 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| order_id | customer_id | count |        newest        |        oldest       |                                                                                                         checks                                                                                                         |
+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|   1491   |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   1390   |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   201    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   182    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   159    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   765    |      2      |   2   | 2021-09-09, id: 765  |  2021-02-11, id: 5  |                                                                                        2021-09-09, id: 765 | 2021-02-11, id: 5                                                                                         |
|    5     |      2      |   2   | 2021-09-09, id: 765  |  2021-02-11, id: 5  |                                                                                        2021-09-09, id: 765 | 2021-02-11, id: 5                                                                                         |
|   1520   |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
|   832    |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
|   766    |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

## Over- samples with constructor

**Over - Each employee record should include the total salary for all employees**

In [22]:
 %reload_ext sql
%sql oracle+cx_oracle://hr:oracle@srv2.lan:1521/free

Connecting and switching to connection 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

In [25]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'Zbigniew',2, 3,6000)
)
SELECT 
   D.*,
   SUM(D.salary) OVER () AS sum_salary
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+------------+
| emp_id |   name   | dep_id | exp_level | salary | sum_salary |
+--------+----------+--------+-----------+--------+------------+
|   1    |   Anna   |   1    |     1     |  1000  |   13000    |
|   2    | Krystyna |   2    |     2     |  5000  |   13000    |
|   3    |   Jan    |   1    |     1     |  1000  |   13000    |
|   4    | Zbigniew |   2    |     3     |  6000  |   13000    |
+--------+----------+--------+-----------+--------+------------+

**Over - Each employee record should include the total salary for all employees in the same department.**

In [30]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
          (5, 'Paul',2, 3,8000),
           (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*,
   SUM(D.salary) OVER (partition by dep_id) AS result
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+--------+
| emp_id |   name   | dep_id | exp_level | salary | result |
+--------+----------+--------+-----------+--------+--------+
|   1    |   Anna   |   1    |     1     |  1000  | 16000  |
|   3    |   Jan    |   1    |     1     |  1000  | 16000  |
|   4    |   John   |   1    |     3     |  7000  | 16000  |
|   6    |  Kumar   |   1    |     3     |  7000  | 16000  |
|   5    |   Paul   |   2    |     3     |  8000  | 13000  |
|   2    | Krystyna |   2    |     2     |  5000  | 13000  |
+--------+----------+--------+-----------+--------+--------+

**Each employee record should include the average salary of the most experienced employees within their department.**

In [47]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
          (5, 'Paul',2, 3,8000),
           (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*,
     CASE D.EXP_LEVEL WHEN 1 THEN 'Junior'
      WHEN 2 THEN 'Mid'
      WHEN 3 THEN 'Senior'
   ELSE NULL END AS explanation,
   AVG(d.salary) KEEP(DENSE_RANK LAST ORDER BY EXP_LEVEL) OVER (partition by dep_id) AS result
   --AVG(salary) FILTER (WHERE exp_level = 3) postgres
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+-------------+--------+
| emp_id |   name   | dep_id | exp_level | salary | explanation | result |
+--------+----------+--------+-----------+--------+-------------+--------+
|   1    |   Anna   |   1    |     1     |  1000  |    Junior   |  7000  |
|   3    |   Jan    |   1    |     1     |  1000  |    Junior   |  7000  |
|   4    |   John   |   1    |     3     |  7000  |    Senior   |  7000  |
|   6    |  Kumar   |   1    |     3     |  7000  |    Senior   |  7000  |
|   5    |   Paul   |   2    |     3     |  8000  |    Senior   |  8000  |
|   2    | Krystyna |   2    |     2     |  5000  |     Mid     |  8000  |
+--------+----------+--------+-----------+--------+-------------+--------+

## Optimization Case - Subquery vs analytic function plan comparision

In [76]:
%%sql
EXPLAIN PLAN SET STATEMENT_ID = 'C1_SQ' FOR
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
          (5, 'Paul',2, 3,8000),
           (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*,
    (select sum(salary) from data) as sq_over
    ,(select sum(salary) from data where dep_id = d.dep_id) as sq_over_partit
    ,(select sum(salary) from data where dep_id = d.dep_id and exp_level = d.exp_level) as sq_over_partit2
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [78]:
%%sql
EXPLAIN PLAN SET STATEMENT_ID = 'C1_OVER' FOR
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*,
    sum(salary) over ()
    , sum(salary) over (partition by dep_id)
    , sum(salary) over (partition by dep_id, exp_level)
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [83]:
df1 = %sql SELECT PLAN_TABLE_OUTPUT FROM TABLE(DBMS_XPLAN.DISPLAY('PLAN_TABLE', 'C1_SQ'))
df2 = %sql SELECT PLAN_TABLE_OUTPUT FROM TABLE(DBMS_XPLAN.DISPLAY('PLAN_TABLE', 'C1_OVER'))

from IPython.display import display
display(df1, df2)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------------------------------------------------------------------------------------------------------------------+
|                                                   plan_table_output                                                    |
+------------------------------------------------------------------------------------------------------------------------+
|                                               Plan hash value: 884601052                                               |
|                                                                                                                        |
| ---------------------------------------------------------------------------------------------------------------------- |
| | Id  | Operation                                | Name                      | Rows  | Bytes | Cost (%CPU)| Time     | |
| ---------------------------------------------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT                         |                           |     6 |   318 |    22  (10)| 00:00:01 | |
| |   1 |  SORT AGGREGATE                          |                           |     1 |     3 |            |          | |
| |   2 |   VIEW                                   |                           |     6 |    18 |     2   (0)| 00:00:01 | |
| |   3 |    TABLE ACCESS FULL                     | SYS_TEMP_0FD9D6612_367AD8 |     6 |   348 |     2   (0)| 00:00:01 | |
| |   4 |  TEMP TABLE TRANSFORMATION               |                           |       |       |            |          | |
+------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

+---------------------------------------------------------------------------+
|                             plan_table_output                             |
+---------------------------------------------------------------------------+
|                        Plan hash value: 1053044315                        |
|                                                                           |
| ------------------------------------------------------------------------- |
| | Id  | Operation        | Name | Rows  | Bytes | Cost (%CPU)| Time     | |
| ------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT |      |     6 |   108 |    13   (8)| 00:00:01 | |
| |   1 |  WINDOW SORT     |      |     6 |   108 |    13   (8)| 00:00:01 | |
| |   2 |   VIEW           |      |     6 |   108 |    12   (0)| 00:00:01 | |
| |   3 |    VALUES SCAN   |      |     6 |       |    12   (0)| 00:00:01 | |
| ------------------------------------------------------------------------- |
+---------------------------------------------------------------------------+
Truncated to displaylimit of 10.

## SUM() with OVER: global, ordered, partitioned, grouped

In [ ]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*
    , sum(salary) over () sum_all_rows
    , sum(salary) over (order by dep_id) sum_running_by_dep_id 
    , sum(salary) over (partition by dep_id) sum_by_dep
    , sum(salary) over (partition by dep_id, exp_level) sum_by_two
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+----------+----------------+------------+----------------+
| emp_id |   name   | dep_id | exp_level | salary | sum_over | sum_order_step | sum_by_dep | sum_by_dep_exp |
+--------+----------+--------+-----------+--------+----------+----------------+------------+----------------+
|   1    |   Anna   |   1    |     1     |  1000  |  29000   |     16000      |   16000    |      2000      |
|   3    |   Jan    |   1    |     1     |  1000  |  29000   |     16000      |   16000    |      2000      |
|   6    |  Kumar   |   1    |     3     |  7000  |  29000   |     16000      |   16000    |     14000      |
|   4    |   John   |   1    |     3     |  7000  |  29000   |     16000      |   16000    |     14000      |
|   2    | Krystyna |   2    |     2     |  5000  |  29000   |     29000      |   13000    |      5000      |
|   5    |   Paul   |   2    |     3     |  8000  |  29000   |     29000      |   13000    |      8000      |
+--------+----------+--------+-----------+--------+----------+----------------+------------+----------------+

## Rank

In [54]:
%%sql
WITH data (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000)
) 
SELECT 
     D.salary
    ,rank() over (order by salary) as rank
    ,dense_rank() over (order by salary) as drank
    ,row_number() over (order by salary) as row_n
    ,percent_rank() over (order by salary) as perc_rank
    ,round(cume_dist() over (order by salary),3) as cume_d
    ,ntile(2) over(order by salary) as ntle2
    ,ntile(3) over(order by salary) as ntle3
    ,ntile(4) over(order by salary) as ntle4
FROM data 
d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+------+-------+-------+-----------+--------+-------+-------+-------+
| salary | rank | drank | row_n | perc_rank | cume_d | ntle2 | ntle3 | ntle4 |
+--------+------+-------+-------+-----------+--------+-------+-------+-------+
|  1000  |  1   |   1   |   1   |     0     | 0.333  |   1   |   1   |   1   |
|  1000  |  1   |   1   |   2   |     0     | 0.333  |   1   |   1   |   1   |
|  5000  |  3   |   2   |   3   |    0.4    |  0.5   |   1   |   2   |   2   |
|  7000  |  4   |   3   |   4   |    0.6    | 0.833  |   2   |   2   |   2   |
|  7000  |  4   |   3   |   5   |    0.6    | 0.833  |   2   |   3   |   3   |
|  8000  |  6   |   4   |   6   |     1     |   1    |   2   |   3   |   4   |
+--------+------+-------+-------+-----------+--------+-------+-------+-------+

## Top employees

In [100]:
%%sql
WITH data (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
), 
   t_rank as (
   SELECT 
   d.*
   ,rank() over (partition by dep_id order by salary desc) rank
   from data d)

select *
from t_rank  t
where rank = 1

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+-------+--------+-----------+--------+------+
| emp_id |  name | dep_id | exp_level | salary | rank |
+--------+-------+--------+-----------+--------+------+
|   4    |  John |   1    |     3     |  7000  |  1   |
|   6    | Kumar |   1    |     3     |  7000  |  1   |
|   5    |  Paul |   2    |     3     |  8000  |  1   |
+--------+-------+--------+-----------+--------+------+

## DENSE_RANK() over salary: global, per department, per department and level

In [89]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
)
SELECT 
   d.*
    , dense_rank() over (order by salary desc) sum_running_by_dep_id 
    , dense_rank() over (partition by dep_id order by salary desc) sum_by_dep
    , dense_rank() over (partition by dep_id, exp_level order by salary desc) sum_by_two
FROM 
DATA d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+-----------------------+------------+------------+
| emp_id |   name   | dep_id | exp_level | salary | sum_running_by_dep_id | sum_by_dep | sum_by_two |
+--------+----------+--------+-----------+--------+-----------------------+------------+------------+
|   5    |   Paul   |   2    |     3     |  8000  |           1           |     1      |     1      |
|   6    |  Kumar   |   1    |     3     |  7000  |           2           |     1      |     1      |
|   4    |   John   |   1    |     3     |  7000  |           2           |     1      |     1      |
|   2    | Krystyna |   2    |     2     |  5000  |           3           |     2      |     1      |
|   7    |  Janusz  |   1    |     1     |  2000  |           4           |     2      |     1      |
|   1    |   Anna   |   1    |     1     |  1000  |           5           |     3      |     2      |
|   3    |   Jan    |   1    |     1     |  1000  |           5           |     3      |     2      |
+--------+----------+--------+-----------+--------+-----------------------+------------+------------+

## WIDTH_BUCKET

In [95]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
)
SELECT 
   d.*,
   WIDTH_BUCKET(salary, 2000, 8000, 4) AS salary_bucket -- 0? <2000; 5? >8000
FROM 
   DATA d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+---------------+
| emp_id |   name   | dep_id | exp_level | salary | salary_bucket |
+--------+----------+--------+-----------+--------+---------------+
|   1    |   Anna   |   1    |     1     |  1000  |       0       |
|   2    | Krystyna |   2    |     2     |  5000  |       3       |
|   3    |   Jan    |   1    |     1     |  1000  |       0       |
|   4    |   John   |   1    |     3     |  7000  |       4       |
|   5    |   Paul   |   2    |     3     |  8000  |       5       |
|   6    |  Kumar   |   1    |     3     |  7000  |       4       |
|   7    |  Janusz  |   1    |     1     |  2000  |       1       |
+--------+----------+--------+-----------+--------+---------------+